<img src="http://drive.google.com/uc?export=view&id=1tpOCamr9aWz817atPnyXus8w5gJ3mIts" width=500px>

Proprietary content. Â© Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited.

---
# Practice Test - Advanced Certificate in Software Engineering - IIT Madras
---

# Instructions

- You need to add the code where ever you see "`/* Add your code here */`"
- **Do not edit any of the prefilled text/code part**

## Run below cells before starting the test - Mandatory

#### Please run the below cell. Don't edit anything.

In [2]:
!pip install --upgrade pip
!pip install ipython-sql

%load_ext sql
%sql sqlite://

Requirement already satisfied: pip in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (21.1.2)
Requirement already satisfied: ipython-sql in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: prettytable<1 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: sqlparse in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.10 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: setuptools>=18.5 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: pickleshare in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pygments in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: decorator in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: backcall in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

#### Please run the below cell. Don't edit anything.

In [3]:
%%sql

DROP TABLE IF EXISTS `employee`;
CREATE TABLE `employee`
(
   `empcode`      INT(4),
   `empname`     VARCHAR(15),
   `job`          VARCHAR(45),
   `hiredate`     DATE,
   `salary`       INT(6),
   `commission`   INT(6)
);

INSERT INTO `employee` values (939, 'Jim', 'SOFTWARE ENGINEER', '1980-12-17', 2800,0);
INSERT INTO `employee` values (949, 'Dwight', 'SALESMAN', '1981-02-20', 1600, 300);    
INSERT INTO `employee` values (966, 'Micheal', 'MANAGER','1981-04-02', 3570,0);
insert into `employee` values (654,'Andy','SALESMAN','1981-09-28',1250,1400);
insert into `employee` values (782,'Kevin','MANAGER','1981-06-09',2940,0);
insert into `employee` values (788,'Pam','ANALYST', '1982-12-09',3000,0);
insert into `employee` values (939,'Oscar','PRESIDENT','1981-11-17',5000,0);
insert into `employee` values (984,'Creed','SALESMAN','1981-09-08',1500,0);
insert into `employee` values (986,'Angela','SOFTWARE ENGINEER','1983-01-12',3100, 0);
insert into `employee` values (990,'Bob','TECHNICAL LEAD','1981-12-03',2950,0);
insert into `employee` values (902,'James','ANALYST','1981-12-03',3000,0);
insert into `employee` values (994,'John','SOFTWARE ENGINEER','1982-01-23',3300,0);
insert into `employee` values (991,'Wendy', 'SALESMAN','1981-02-22',500,0);
insert into `employee` values (698,'Joe', 'MANAGER','1981-05-01',3420,0);
insert into `employee` values (977,'Max', 'ANALYST','1981-05-01',2000,200);
insert into `employee` values (960,'Stanely', 'ANALYST','1992-06-21',7000,100);
insert into `employee` values (861,'Jennifer','ANALYST','1996-07-01',5000,100);

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Please run the below cell. Don't edit anything.

In [4]:
%%sql

select * from employee;

 * sqlite://
Done.

[(939, 'Jim', 'SOFTWARE ENGINEER', '1980-12-17', 2800, 0),
 (949, 'Dwight', 'SALESMAN', '1981-02-20', 1600, 300),
 (966, 'Micheal', 'MANAGER', '1981-04-02', 3570, 0),
 (654, 'Andy', 'SALESMAN', '1981-09-28', 1250, 1400),
 (782, 'Kevin', 'MANAGER', '1981-06-09', 2940, 0),
 (788, 'Pam', 'ANALYST', '1982-12-09', 3000, 0),
 (939, 'Oscar', 'PRESIDENT', '1981-11-17', 5000, 0),
 (984, 'Creed', 'SALESMAN', '1981-09-08', 1500, 0),
 (986, 'Angela', 'SOFTWARE ENGINEER', '1983-01-12', 3100, 0),
 (990, 'Bob', 'TECHNICAL LEAD', '1981-12-03', 2950, 0),
 (902, 'James', 'ANALYST', '1981-12-03', 3000, 0),
 (994, 'John', 'SOFTWARE ENGINEER', '1982-01-23', 3300, 0),
 (991, 'Wendy', 'SALESMAN', '1981-02-22', 500, 0),
 (698, 'Joe', 'MANAGER', '1981-05-01', 3420, 0),
 (977, 'Max', 'ANALYST', '1981-05-01', 2000, 200),
 (960, 'Stanely', 'ANALYST', '1992-06-21', 7000, 100),
 (861, 'Jennifer', 'ANALYST', '1996-07-01', 5000, 100)]

---

### **Refer to the `employee` table to answer the below questions**

## Question 1

Find out the lowest and highest (`salary+commission`) for each `job` in `employee` table

In [85]:
%%sql

SELECT job, MAX(salary+commission), MIN(salary+commission) FROM employee GROUP BY job;

 * sqlite://
Done.

[('ANALYST', 7100, 2200),
 ('MANAGER', 3570, 2940),
 ('PRESIDENT', 5000, 5000),
 ('SALESMAN', 2650, 500),
 ('SOFTWARE ENGINEER', 3300, 2800),
 ('TECHNICAL LEAD', 2950, 2950)]

## Question 2

Find out the the top three highest paying jobs (`salary+commission`) from the `employee` table.

In [86]:
%%sql

SELECT job, MAX(salary+commission) AS totalsalary FROM employee GROUP BY job ORDER BY totalsalary DESC LIMIT 3;

 * sqlite://
Done.

[('ANALYST', 7100), ('PRESIDENT', 5000), ('MANAGER', 3570)]

## Question 3

Find out all the details of `employee` with the third highest `salary`.

In [87]:
%%sql

SELECT * FROM employee where salary = (SELECT DISTINCT(salary) FROM employee ORDER BY salary DESC LIMIT 2,1);

 * sqlite://
Done.

[(966, 'Micheal', 'MANAGER', '1981-04-02', 3570, 0)]